Repository: inovativestar/swift-ble-manage
Catalog: translate/*.lproj/Localizable.strings
Languages: he

source: Open Door
he: פתח דלת

source: No Devices Press to find
he: אין התקנים לחץ למציאה

source: Find
he: חפש

source: scanning for devices
he: מחפש התקנים

# select_device
source: select a device to connect
he: בחר התקן לחיבור

source: Scan for devices
he: סרוק התקנים

source: Guest Name
he: שם אורח

source: Enter Old Password
he: הכנס סיסמא ישנה

source: Enter Name
he: הכנס שם

source: Enter New Password
he: הכנס סיסמא חדשה

source: Confirm
he: אשר

source: Cancel
he: בטל

source: Enter Password
he: הכנס סיסמא

# confirm_password_incorrect
source: Please confirm password.
he: אנא וודא סיסמה.

source: Invalid old password.
he: סיסמא ישנה שגויה

# short_password
source: Password should be 6 digits.
he: סיסמא צריכה להיות 6 תווים

source: Delete
he: מחק

source: Change Password
he: שנה סיסמא

source: Whoops
he: אופס

# password_invalid
source: Invalid Password.
he: סיסמא שגויה

source: Bluetooth is off
he: מכובה Bluetooth

source: Go to settings
he: עבור להגדרות

# please_turn_bluetooth
source: Please turn on your bluetooth
he: bluetooth אנא הדלק

# enter_confirm_passowrd
source: Enter Confirm Password
he: הכנס הסיסמא שנית

source: Cancel Default
he: בטל ברירת מחדל

source: Make Default
he: סמן כברירת מחדל
